# 確率論ではランダムな出来事のことを事象 (event)と呼びます
#

"""
6.1. 確率・統計と機械学習の関係
機械学習システムが学習に用いるのは限られた数の観測データですが、多くの機械学習タスクでやりたいことは、与えられた観測データの背後にある普遍性や法則を捉え、将来の出来事に対し予測を行えることです。機械学習ではそれを達成するために統計学の考え方を利用します。

統計学では、ある集団すべてについて調査ができない時、集団からランダムサンプリングを行い元の集団の性質を推定します。

6.3. 同時分布・周辺確率

このように、周辺確率はしばしば同時分布表の周辺に記述されます。


6.4. 条件付き確率
全部で 7 個のデータがあり、この中で「雨が降っていなかった（ Y=0 ）」となっているデータは 1 個です。すなわち、「客が傘を持っていたという条件の下で、そのとき雨が降っていなかった確率」は 1/7 となります。これを、以下のように書きます。

p(Y=0|X=1)=17
これが条件付き確率と呼ばれるもので、条件となる事象を縦棒 | の後に書き、その条件下で注目している事象を縦棒 | の前に書きます。同様に、「客が傘を持っていたという条件の下で、そのとき雨が降っていた確率」は、上の表から 6/7 なので、以下が成り立ちます。

p(Y=1|X=1)=67

6. 確率・統計の基礎
6.1. 確率・統計と機械学習の関係
6.2. 確率変数と確率分布
6.3. 同時分布・周辺確率
6.4. 条件付き確率
6.5. ベイズの定理
6.6. 尤度と最尤推定
6.7. 事後確率最大化推定（MAP推定）
6.8. 統計量

"""
